clamp_69/clamp_69_01/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v9                                    |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
 *---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
(0 0 0)
(2.56830414474775 0 0)
(2.56830414474775 0.125800585191814 0)
(0.0683041447477459 0.125800585191814 0)
(3.95536096498497 2 0)
(3.95536096498497 2.83867056794542 0)
(5.04463903501503 2 0)
(5.04463903501503 2.83867056794542 0)
(6.43169585525225 0.125800585191814 0)
(8.93169585525225 0.125800585191814 0)
(6.43169585525225 0 0)
(9 0 0)
(-11.15 0 0)
(-1.15 0 0)
(-1.15 0.251601170383627 0)
(-11.15 0.251601170383627 0)
(-1.15 2.25160117038363 0)
(-11.15 2.25160117038363 0)
(-1.15 11 0)
(-11.15 11 0)
(2.87366510973272 3.96447115313724 0)
(2.87366510973272 11 0)
(3.87366510973272 3.96447115313724 0)
(3.87366510973272 11 0)
(5.12633489026728 3.96447115313724 0)
(5.12633489026728 11 0)
(6.12633489026728 3.96447115313724 0)
(6.12633489026728 11 0)
(10.15 2.25160117038363 0)
(10.15 11 0)
(20.15 2.25160117038363 0)
(20.15 11 0)
(10.15 0.251601170383627 0)
(20.15 0.251601170383627 0)
(10.15 0 0)
(20.15 0 0)
(-1.15 0 0)
(-0.15 0 0)
(-0.0133917105045082 0.251601170383627 0)
(-1.15 0.251601170383627 0)
(3.87366510973272 2.96447115313724 0)
(2.87366510973272 2.96447115313724 0)
(2.87366510973272 3.96447115313724 0)
(-1.15 2.25160117038363 0)
(3.87366510973272 3.96447115313724 0)
(5.12633489026728 2.96447115313724 0)
(5.12633489026728 3.96447115313724 0)
(6.12633489026728 2.96447115313724 0)
(6.12633489026728 3.96447115313724 0)
(10.15 0.251601170383627 0)
(10.15 2.25160117038363 0)
(9.01339171050451 0.251601170383627 0)
(9.15 0 0)
(10.15 0 0)
(-0.15 0 0)
(0 0 0)
(0.0683041447477459 0.125800585191814 0)
(-0.0133917105045082 0.251601170383627 0)
(3.95536096498497 2.83867056794542 0)
(3.87366510973272 2.96447115313724 0)
(5.04463903501503 2.83867056794542 0)
(5.12633489026728 2.96447115313724 0)
(8.93169585525225 0.125800585191814 0)
(9.01339171050451 0.251601170383627 0)
(9 0 0)
(9.15 0 0)
(0 0 0.1)
(2.56830414474775 0 0.1)
(2.56830414474775 0.125800585191814 0.1)
(0.0683041447477459 0.125800585191814 0.1)
(3.95536096498497 2 0.1)
(3.95536096498497 2.83867056794542 0.1)
(5.04463903501503 2 0.1)
(5.04463903501503 2.83867056794542 0.1)
(6.43169585525225 0.125800585191814 0.1)
(8.93169585525225 0.125800585191814 0.1)
(6.43169585525225 0 0.1)
(9 0 0.1)
(-11.15 0 0.1)
(-1.15 0 0.1)
(-1.15 0.251601170383627 0.1)
(-11.15 0.251601170383627 0.1)
(-1.15 2.25160117038363 0.1)
(-11.15 2.25160117038363 0.1)
(-1.15 11 0.1)
(-11.15 11 0.1)
(2.87366510973272 3.96447115313724 0.1)
(2.87366510973272 11 0.1)
(3.87366510973272 3.96447115313724 0.1)
(3.87366510973272 11 0.1)
(5.12633489026728 3.96447115313724 0.1)
(5.12633489026728 11 0.1)
(6.12633489026728 3.96447115313724 0.1)
(6.12633489026728 11 0.1)
(10.15 2.25160117038363 0.1)
(10.15 11 0.1)
(20.15 2.25160117038363 0.1)
(20.15 11 0.1)
(10.15 0.251601170383627 0.1)
(20.15 0.251601170383627 0.1)
(10.15 0 0.1)
(20.15 0 0.1)
(-1.15 0 0.1)
(-0.15 0 0.1)
(-0.0133917105045082 0.251601170383627 0.1)
(-1.15 0.251601170383627 0.1)
(3.87366510973272 2.96447115313724 0.1)
(2.87366510973272 2.96447115313724 0.1)
(2.87366510973272 3.96447115313724 0.1)
(-1.15 2.25160117038363 0.1)
(3.87366510973272 3.96447115313724 0.1)
(5.12633489026728 2.96447115313724 0.1)
(5.12633489026728 3.96447115313724 0.1)
(6.12633489026728 2.96447115313724 0.1)
(6.12633489026728 3.96447115313724 0.1)
(10.15 0.251601170383627 0.1)
(10.15 2.25160117038363 0.1)
(9.01339171050451 0.251601170383627 0.1)
(9.15 0 0.1)
(10.15 0 0.1)
(-0.15 0 0.1)
(0 0 0.1)
(0.0683041447477459 0.125800585191814 0.1)
(-0.0133917105045082 0.251601170383627 0.1)
(3.95536096498497 2.83867056794542 0.1)
(3.87366510973272 2.96447115313724 0.1)
(5.04463903501503 2.83867056794542 0.1)
(5.12633489026728 2.96447115313724 0.1)
(8.93169585525225 0.125800585191814 0.1)
(9.01339171050451 0.251601170383627 0.1)
(9 0 0.1)
(9.15 0 0.1)
);

blocks
(
hex (0 1 2 3 66 67 68 69) clamp_0 (18 3 1) simpleGrading (1 1 1)
hex (3 2 4 5 69 68 70 71) clamp_1 (18 27 1) simpleGrading (1 1 1)
hex (4 6 7 5 70 72 73 71) clamp_2 (9 18 1) simpleGrading (1 1 1)
hex (8 9 7 6 74 75 73 72) clamp_3 (18 27 1) simpleGrading (1 1 1)
hex (10 11 9 8 76 77 75 74) clamp_4 (18 3 1) simpleGrading (1 1 1)
hex (1 10 8 2 67 76 74 68) clamp_5 (9 3 1) simpleGrading (1 1 1)
hex (2 8 6 4 68 74 72 70) clamp_6 (9 27 1) simpleGrading (1 1 1)
hex (12 13 14 15 78 79 80 81) outer_domain_7 (30 3 1) simpleGrading (1 1 1)
hex (15 14 16 17 81 80 82 83) outer_domain_8 (30 6 1) simpleGrading (1 1 1)
hex (17 16 18 19 83 82 84 85) outer_domain_9 (30 27 1) simpleGrading (1 1 1)
hex (16 20 21 18 82 86 87 84) outer_domain_10 (14 27 1) simpleGrading (1 1 1)
hex (20 22 23 21 86 88 89 87) outer_domain_11 (3 27 1) simpleGrading (1 1 1)
hex (22 24 25 23 88 90 91 89) outer_domain_12 (5 27 1) simpleGrading (1 1 1)
hex (24 26 27 25 90 92 93 91) outer_domain_13 (3 27 1) simpleGrading (1 1 1)
hex (26 28 29 27 92 94 95 93) outer_domain_14 (14 27 1) simpleGrading (1 1 1)
hex (28 30 31 29 94 96 97 95) outer_domain_15 (30 27 1) simpleGrading (1 1 1)
hex (32 33 30 28 98 99 96 94) outer_domain_16 (30 6 1) simpleGrading (1 1 1)
hex (34 35 33 32 100 101 99 98) outer_domain_17 (30 3 1) simpleGrading (1 1 1)
hex (36 37 38 39 102 103 104 105) inner_domain_18 (6 3 1) simpleGrading (1 1 1)
hex (39 38 40 41 105 104 106 107) inner_domain_19 (6 27 1) simpleGrading (1 1 1)
hex (39 41 42 43 105 107 108 109) inner_domain_20 (27 12 1) simpleGrading (1 1 1)
hex (41 40 44 42 107 106 110 108) inner_domain_21 (6 12 1) simpleGrading (1 1 1)
hex (40 45 46 44 106 111 112 110) inner_domain_22 (9 12 1) simpleGrading (1 1 1)
hex (45 47 48 46 111 113 114 112) inner_domain_23 (6 12 1) simpleGrading (1 1 1)
hex (47 49 50 48 113 115 116 114) inner_domain_24 (27 12 1) simpleGrading (1 1 1)
hex (51 49 47 45 117 115 113 111) inner_domain_25 (6 27 1) simpleGrading (1 1 1)
hex (52 53 49 51 118 119 115 117) inner_domain_26 (6 3 1) simpleGrading (1 1 1)
hex (54 55 56 57 120 121 122 123) cover_27 (2 3 1) simpleGrading (1 1 1)
hex (57 56 58 59 123 122 124 125) cover_28 (2 27 1) simpleGrading (1 1 1)
hex (58 60 61 59 124 126 127 125) cover_29 (9 2 1) simpleGrading (1 1 1)
hex (62 63 61 60 128 129 127 126) cover_30 (2 27 1) simpleGrading (1 1 1)
hex (64 65 63 62 130 131 129 128) cover_31 (2 3 1) simpleGrading (1 1 1)
);

edges
(
arc 0 3 (0.0181774331007052 0.0715738140389413 0)
arc 66 69 (0.0181774331007052 0.0715738140389413 0.1)
arc 7 5 (4.5 3 0)
arc 73 71 (4.5 3 0.1)
arc 11 9 (8.98182256689929 0.0715738140389413 0)
arc 77 75 (8.98182256689929 0.0715738140389413 0.1)
arc 37 38 (-0.11364513379859 0.143147628077883 0)
arc 103 104 (-0.11364513379859 0.143147628077883 0.1)
arc 40 45 (4.5 3.15 0)
arc 106 111 (4.5 3.15 0.1)
arc 52 51 (9.11364513379859 0.143147628077883 0)
arc 118 117 (9.11364513379859 0.143147628077883 0.1)
arc 54 57 (-0.11364513379859 0.143147628077883 0)
arc 120 123 (-0.11364513379859 0.143147628077883 0.1)
 arc 55 56 (0.0181774331007052 0.0715738140389413 0)
arc 121 122 (0.0181774331007052 0.0715738140389413 0.1)
arc 58 60 (4.5 3 0)
arc 124 126 (4.5 3 0.1)
 arc 61 59 (4.5 3.15 0)
arc 127 125 (4.5 3.15 0.1)
arc 64 62 (8.98182256689929 0.0715738140389413 0)
arc 130 128 (8.98182256689929 0.0715738140389413 0.1)
 arc 65 63 (9.11364513379859 0.143147628077883 0)
arc 131 129 (9.11364513379859 0.143147628077883 0.1)
);

boundary
(
  inlet
  {
    type patch;
    faces
    (
(12 15 81 78)
(15 17 83 81)
(17 19 85 83)
 );
  }
  outlet
  {
    type patch;
    faces
    (
      (30 31 97 96)
(33 30 96 99)
(35 33 99 101)
 );
  }
  top
  {
    type symmetryPlane;
    faces
    (
      (18 19 85 84)
(21 18 84 87)
(23 21 87 89)
(25 23 89 91)
(27 25 91 93)
(29 27 93 95)
(31 29 95 97)
 );
  }
  ground
  {
    type wall;
    faces
    (
      (0 1 67 66)
(10 11 77 76)
(1 10 76 67)
(12 13 79 78)
(34 35 101 100)
(36 37 103 102)
(52 53 119 118)
(54 55 121 120)
(64 65 131 130)
 );
  }
  frontAndBack
  {
    type empty;
    faces
    (
      (0 1 2 3)
 (66 67 68 69)
(3 2 4 5)
 (69 68 70 71)
(4 6 7 5)
 (70 72 73 71)
(8 9 7 6)
 (74 75 73 72)
(10 11 9 8)
 (76 77 75 74)
(1 10 8 2)
 (67 76 74 68)
(2 8 6 4)
 (68 74 72 70)
(12 13 14 15)
 (78 79 80 81)
(15 14 16 17)
 (81 80 82 83)
(17 16 18 19)
 (83 82 84 85)
(16 20 21 18)
 (82 86 87 84)
(20 22 23 21)
 (86 88 89 87)
(22 24 25 23)
 (88 90 91 89)
(24 26 27 25)
 (90 92 93 91)
(26 28 29 27)
 (92 94 95 93)
(28 30 31 29)
 (94 96 97 95)
(32 33 30 28)
 (98 99 96 94)
(34 35 33 32)
 (100 101 99 98)
(36 37 38 39)
 (102 103 104 105)
(39 38 40 41)
 (105 104 106 107)
(39 41 42 43)
 (105 107 108 109)
(41 40 44 42)
 (107 106 110 108)
(40 45 46 44)
 (106 111 112 110)
(45 47 48 46)
 (111 113 114 112)
(47 49 50 48)
 (113 115 116 114)
(51 49 47 45)
 (117 115 113 111)
(52 53 49 51)
 (118 119 115 117)
(54 55 56 57)
 (120 121 122 123)
(57 56 58 59)
 (123 122 124 125)
(58 60 61 59)
 (124 126 127 125)
(62 63 61 60)
 (128 129 127 126)
(64 65 63 62)
 (130 131 129 128)
 );
  }
    merge_clamp_top
    {
    type wall;
    faces
    (
       (0 3 66 69)
 (3 5 69 71)
 (5 7 71 73)
 (7 9 73 75)
 (9 11 75 77)
    );
  }
merge_cover_bottom
    {
    type wall;
    faces
    (
       (55 56 121 122)
 (56 58 122 124)
 (58 60 124 126)
 (60 62 126 128)
 (62 64 128 130)
    );
  }
merge_cover_top
    {
    type wall;
    faces
    (
       (54 57 120 123)
 (57 59 123 125)
 (59 61 125 127)
 (61 63 127 129)
 (63 65 129 131)
    );
  }
merge_inner_bottom
    {
    type wall;
    faces
    (
       (37 38 103 104)
 (38 40 104 106)
 (40 45 106 111)
 (45 51 111 117)
 (51 52 117 118)
    );
  }
merge_inner_top
    {
    type wall;
    faces
    (
       (36 39 102 105)
 (39 43 105 109)
 (43 42 109 108)
 (42 44 108 110)
 (44 46 110 112)
 (46 48 112 114)
 (48 50 114 116)
 (50 49 116 115)
 (49 53 115 119)
    );
  }
merge_outer_bottom
    {
    type wall;
    faces
    (
       (13 14 79 80)
 (14 16 80 82)
 (16 20 82 86)
 (20 22 86 88)
 (22 24 88 90)
 (24 26 90 92)
 (26 28 92 94)
 (28 32 94 98)
 (32 34 98 100)
    );
  }
);
mergePatchPairs
(
  (merge_inner_top merge_outer_bottom)
  (merge_cover_top merge_inner_bottom)
  (merge_clamp_top merge_cover_bottom)
);
